# Pandas

Requirement already satisfied: pandas in c:\Users\anura\AppData\Local\Programs\Python\Python312\Lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\Users\anura\AppData\Local\Programs\Python\Python312\Lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\Users\anura\AppData\Local\Programs\Python\Python312\Lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\Users\anura\AppData\Local\Programs\Python\Python312\Lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\Users\anura\AppData\Local\Programs\Python\Python312\Lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\Users\anura\AppData\Local\Programs\Python\Python312\Lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

In [ ]:
## Pandas Series one d array that holds any type of data
data = [1,2,3,4,5]
series = pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
# Create a Series from Dict
data = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [8]:
data = [10,20,30]
index = ['a','b','c']

pd.Series(data,index)

a    10
b    20
c    30
dtype: int64

In [10]:
# Dataframe
## Create a Dataframe from a dictionary of list
data = {
  'Name':["AJ","BJ","CJ","DJ"],
  "Age":[25,30,45,102],
  "City":["IDK1","IDK2","IDK3","IDK4"]
}

df = pd.DataFrame(data)
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
  Name  Age  City
0   AJ   25  IDK1
1   BJ   30  IDK2
2   CJ   45  IDK3
3   DJ  102  IDK4

In [18]:
# Create a Data Frame a Lsit of Dict
data = [
  {"Name":"AJ","age":25,"city":"NY"},
  {"Name":"BJ","age":22,"city":"Dallas"},
  {"Name":"CJ","age":26,"city":"Texas"},
  {"Name":"DJ","age":28,"city":"Calfornia"},
]

df = pd.DataFrame(data)
print(df)
print(type(df))

  Name  age       city
0   AJ   25         NY
1   BJ   22     Dallas
2   CJ   26      Texas
3   DJ   28  Calfornia
<class 'pandas.core.frame.DataFrame'>

In [13]:
df = pd.read_csv('aapl_master_enriched.csv')
print(df.head(10))
print(df.tail(10))

         date      open      high       low     close     volume  dividends  \
0  1980-12-12  0.098389  0.098817  0.098389  0.098389  469033600        0.0
1  1980-12-15  0.093684  0.093684  0.093256  0.093256  175884800        0.0
2  1980-12-16  0.086839  0.086839  0.086412  0.086412  105728000        0.0
3  1980-12-17  0.088550  0.088978  0.088550  0.088550   86441600        0.0
4  1980-12-18  0.091118  0.091545  0.091118  0.091118   73449600        0.0
5  1980-12-19  0.096678  0.097106  0.096678  0.096678   48630400        0.0
6  1980-12-22  0.101384  0.101812  0.101384  0.101384   37363200        0.0
7  1980-12-23  0.105662  0.106090  0.105662  0.105662   46950400        0.0
8  1980-12-24  0.111223  0.111651  0.111223  0.111223   48003200        0.0
9  1980-12-26  0.121490  0.121917  0.121490  0.121490   55574400        0.0

   stock_splits  price_range  price_change  ...  revenue_services  \
0           0.0     0.000428      0.000000  ...               NaN
1           0.0     0.000428     -0.000428  ...               NaN
2           0.0     0.000428     -0.000428  ...               NaN
3           0.0     0.000428      0.000000  ...               NaN
4           0.0     0.000428      0.000000  ...               NaN
5           0.0     0.000428      0.000000  ...               NaN
6           0.0     0.000429      0.000000  ...               NaN
7           0.0     0.000428      0.000000  ...               NaN
8           0.0     0.000428      0.000000  ...               NaN
9           0.0     0.000428      0.000000  ...               NaN

   revenue_wearables_other  revenue_ipad  revenue_iphone  revenue_total  \
0                      NaN           NaN             NaN            NaN
1                      NaN           NaN             NaN            NaN
2                      NaN           NaN             NaN            NaN
3                      NaN           NaN             NaN            NaN
4                      NaN           NaN             NaN            NaN
5                      NaN           NaN             NaN            NaN
6                      NaN           NaN             NaN            NaN
7                      NaN           NaN             NaN            NaN
8                      NaN           NaN             NaN            NaN
9                      NaN           NaN             NaN            NaN

   share_mac  share_services  share_wearables_other  share_ipad  share_iphone
0        NaN             NaN                    NaN         NaN           NaN
1        NaN             NaN                    NaN         NaN           NaN
2        NaN             NaN                    NaN         NaN           NaN
3        NaN             NaN                    NaN         NaN           NaN
4        NaN             NaN                    NaN         NaN           NaN
5        NaN             NaN                    NaN         NaN           NaN
6        NaN             NaN                    NaN         NaN           NaN
7        NaN             NaN                    NaN         NaN           NaN
8        NaN             NaN                    NaN         NaN           NaN
9        NaN             NaN                    NaN         NaN           NaN

[10 rows x 81 columns]
           date      open      high       low     close    volume  dividends  \
188  1981-09-11  0.067590  0.067590  0.067162  0.067162  17539200        0.0
189  1981-09-14  0.065450  0.065450  0.065022  0.065022  27686400        0.0
190  1981-09-15  0.063739  0.063739  0.063311  0.063311  19510400        0.0
191  1981-09-16  0.062456  0.062456  0.062028  0.062028  19353600        0.0
192  1981-09-17  0.060745  0.060745  0.060317  0.060317  19376000        0.0
193  1981-09-18  0.060745  0.061173  0.060745  0.060745  26320000        0.0
194  1981-09-21  0.061173  0.061600  0.061173  0.061173  49033600        0.0
195  1981-09-22  0.058178  0.058178  0.057751  0.057751  47420800        0.0
196  1981-09-23  0.057323  0.057323  0.056467  0.056467  28201600        0.0
197  1981-09-24  0.056467  0.056467  0.056040  0.056040  18300800        0.0

     stock_splits  price_range  price_change  ...  revenue_services  \
188           0.0     0.000428     -0.000428  ...               NaN
189           0.0     0.000428     -0.000428  ...               NaN
190           0.0     0.000428     -0.000428  ...               NaN
191           0.0     0.000428     -0.000428  ...               NaN
192           0.0     0.000428     -0.000428  ...               NaN
193           0.0     0.000428      0.000000  ...               NaN
194           0.0     0.000428      0.000000  ...               NaN
195           0.0     0.000428     -0.000428  ...               NaN
196           0.0     0.000856     -0.000856  ...               NaN
197           0.0     0.000428     -0.000428  ...               NaN

     revenue_wearables_other  revenue_ipad  revenue_iphone  revenue_total  \
188                      NaN           NaN             NaN            NaN
189                      NaN           NaN             NaN            NaN
190                      NaN           NaN             NaN            NaN
191                      NaN           NaN             NaN            NaN
192                      NaN           NaN             NaN            NaN
193                      NaN           NaN             NaN            NaN
194                      NaN           NaN             NaN            NaN
195                      NaN           NaN             NaN            NaN
196                      NaN           NaN             NaN            NaN
197                      NaN           NaN             NaN            NaN

     share_mac  share_services  share_wearables_other  share_ipad  \
188        NaN             NaN                    NaN         NaN
189        NaN             NaN                    NaN         NaN
190        NaN             NaN                    NaN         NaN
191        NaN             NaN                    NaN         NaN
192        NaN             NaN                    NaN         NaN
193        NaN             NaN                    NaN         NaN
194        NaN             NaN                    NaN         NaN
195        NaN             NaN                    NaN         NaN
196        NaN             NaN                    NaN         NaN
197        NaN             NaN                    NaN         NaN

     share_iphone
188           NaN
189           NaN
190           NaN
191           NaN
192           NaN
193           NaN
194           NaN
195           NaN
196           NaN
197           NaN

[10 rows x 81 columns]

In [ ]:
## Accessing data from Dataframe
df['Name']
type(df['Name'])
df.loc[0] #Zeroth Row Value

Name    AJ
age     25
city    NY
Name: 0, dtype: object

In [38]:
df.loc[0:3,'Name']

0    AJ
1    BJ
2    CJ
3    DJ
Name: Name, dtype: object

In [36]:
df.iloc[0][1:3]

age     25
city    NY
Name: 0, dtype: object

In [ ]:
## Accessing the specified Element
df.at[1,'age'] # index and column label

22

In [ ]:
## Accessing Specified Element using iat
df.iat[2,2] # Row index and Column Index

'Texas'

In [43]:
# Data Manipulation with Dataframe
df

  Name  age       city
0   AJ   25         NY
1   BJ   22     Dallas
2   CJ   26      Texas
3   DJ   28  Calfornia

In [45]:
df['salary'] = [100000000,500000000,6000000000,80000000]
df

  Name  age       city      salary
0   AJ   25         NY   100000000
1   BJ   22     Dallas   500000000
2   CJ   26      Texas  6000000000
3   DJ   28  Calfornia    80000000

In [ ]:
# Remove a column
df.drop('salary',axis=1,inplace=True)

In [48]:
df

  Name  age       city
0   AJ   25         NY
1   BJ   22     Dallas
2   CJ   26      Texas
3   DJ   28  Calfornia

In [ ]:
# Increase Age to the Column 
df['age']+=1

In [50]:
df

  Name  age       city
0   AJ   26         NY
1   BJ   23     Dallas
2   CJ   27      Texas
3   DJ   29  Calfornia

In [52]:
# df.drop(0)
df.drop(0,inplace=True) # Parmanent Delete
df.describe()

             age
count   3.000000
mean   26.333333
std     3.055050
min    23.000000
25%    25.000000
50%    27.000000
75%    28.000000
max    29.000000